import time
from random import randint

from src.util.build_tools.starter import compile_string, run_compiled_code

ARR = [str(randint(0, 100)) for _ in range(100)]

code = compile_string(
    f"""
    ВКЛЮЧИТЬ стандартная_библиотека.*
    
    ОПРЕДЕЛИТЬ ПРОЦЕДУРУ быстрая_сортировка(массив_чисел, левый_индекс, правый_индекс) (
        ЕСЛИ левый_индекс МЕНЬШЕ правый_индекс ТО (
            ЗАДАТЬ опорный_индекс = разделить_массив(массив_чисел, левый_индекс, правый_индекс);
    
            ! Рекурсивно сортируем элементы до и после опорного
            быстрая_сортировка(массив_чисел, левый_индекс, опорный_индекс - 1);
            быстрая_сортировка(массив_чисел, опорный_индекс + 1, правый_индекс);
        )
    )
    
    ОПРЕДЕЛИТЬ ПРОЦЕДУРУ разделить_массив(массив_чисел, левый_индекс, правый_индекс) (
        ЗАДАТЬ опорный_элемент = достать_из_массива(массив_чисел, правый_индекс);
        ЗАДАТЬ индекс_меньшего = левый_индекс - 1;
    
        ЦИКЛ индекс ОТ левый_индекс ДО правый_индекс - 1 (
            ЕСЛИ достать_из_массива(массив_чисел, индекс) МЕНЬШЕ опорный_элемент ТО (
                индекс_меньшего = индекс_меньшего + 1;
    
                ! Меняем местами элементы
                ЗАДАТЬ временная_переменная = достать_из_массива(массив_чисел, индекс_меньшего);
                изменить_в_массиве(массив_чисел, индекс_меньшего, достать_из_массива(массив_чисел, индекс));
                изменить_в_массиве(массив_чисел, индекс, временная_переменная);
            )
        )
    
        ! Меняем местами опорный элемент
        ЗАДАТЬ временная_переменная = достать_из_массива(массив_чисел, индекс_меньшего + 1);
        изменить_в_массиве(массив_чисел, индекс_меньшего + 1, достать_из_массива(массив_чисел, правый_индекс));
        изменить_в_массиве(массив_чисел, правый_индекс, временная_переменная);
    
        ВЕРНУТЬ индекс_меньшего + 1;
    )
    
    ОПРЕДЕЛИТЬ ПРОЦЕДУРУ сортировка_массива(массив_чисел) (
        ЗАДАТЬ длина = длина_массива(массив_чисел);
        ЕСЛИ длина БОЛЬШЕ 0 ТО (
            быстрая_сортировка(массив_чисел, 0, длина - 1);
        )
        НАПЕЧАТАТЬ массив_чисел;
    )
    
    ОПРЕДЕЛИТЬ ПРОЦЕДУРУ стандартная_сортировка_массива(массив_чисел) (
        НАПЕЧАТАТЬ сортировать_массив(массив_чисел);
    )
    
    ВЫПОЛНИТЬ (
        сортировка_массива(массив({", ".join(ARR)}));
        !стандартная_сортировка_массива(массив({", ".join(ARR)}));
    )
    """
)


s = time.perf_counter()
run_compiled_code(code)
print(time.perf_counter() - s)
